Repository: CStrnad/SE423_Lab
Catalog: C2Prog2.x/locale/*/c2prog.po
Languages: de

source: Codeskin Chip Programmer (c) Codeskin LLC
de: Codeskin Chip Programmierer (c) Codeskin LLC

source: The use of C2Prog is governed by the following licenses:
de: Die Verwendung von C2Prog unterliegt den folgenden Lizenzen:

source: About C2Prog
de: Über C2Prog

source: locale
de: Gebietsschema

source: Locale "%s" is unknown.
de: Gebietsschema "%s" ist unbekannt.

source: The requested locale could not be set successfully.
de: Das angeforderte Gebietsschema konnte nicht erfolgreich festgelegt werden.

source: Application resource file 'c2prog.zrc' not found.
de: Anwendungsressourcendatei 'c2prog.zrc' wurde nicht gefunden.

source: C2Prog API could not be loaded.
de: Das C2Prog-API konnte nicht geladen werden.

source: Quit
de: Beenden

source: File
de: Datei

source: Settings
de: Einstellungen

source: Manual
de: Handbuch

source: Visit CodeSkin
de: CodeSkin besuchen

source: Automatically check for updates
de: Automatische Überprüfung auf Updates

source: Check for update
de: Auf Update prüfen

source: Help
de: Hilfe

source: Serial
de: Seriell

source: Actions...
de: Aktionen...

source: Select Port...
de: Port auswählen...

source: Program
de: Programmieren

source: Action settings could not be parsed.
de: Aktionseinstellungen konnten nicht analysiert werden.

source: Please choose language:
de: Bitte eine Sprache auswählen:

source: Language Settings
de: Spracheinstellungen

source: The selected language '%s' will be used on starting the application the next time.
de: Die ausgewählte Sprache '%s' wird beim nächsten Starten der Anwendung verwendet.

source: No translation catalogs were found. English will be used.
de: Es wurden keine Übersetzungskataloge gefunden. Es wird Englisch verwendet.

source: The default browser could not be launched to display the CodeSkin Homepage.
de: Der Standardbrowser konnte nicht gestartet werden, um die CodeSkin-Homepage anzuzeigen.

source: Error displaying CodeSkin homepage
de: Fehler beim Anzeigen der CodeSkin-Homepage

source: You already have the latest version installed.
de: Sie haben bereits die neueste Version installiert.

source: Check for software update failed.
de: Die Überprüfung auf Software-Updates ist fehlgeschlagen.

source: Error code %d
de: Fehlercode %d

source: The default browser could not be launched to display the CodeSkin Download page.
de: Der Standardbrowser konnte nicht gestartet werden, um die CodeSkin-Downloadseite anzuzeigen.

source: Error displaying CodeSkin Download page
de: Fehler beim Anzeigen der CodeSkin-Downloadseite

source: Port Selection
de: Portauswahl

source: Callback info could not be parsed.
de: Die Callback-Info konnte nicht analysiert werden.

source: CodeSkin Chip Programmer
de: CodeSkin Chip Programmierer

source: Configuration data not a valid JSON object.
de: Die Konfigurationsdaten bilden kein gültiges JSON-Objekt.

source: Form field specification not a valid JSON object.
de: Die Formularfeldspezifikation ist kein gültiges JSON-Objekt.

source: Configuration data could not be parsed.
de: Konfigurationsdaten konnten nicht analysiert werden.

source: Form field specification could not be parsed.
de: Die Formularfeldspezifikation konnte nicht analysiert werden.

source: Invalid data type for scalar parameter '%s'.
de: Ungültiger Datentyp für den skalaren Parameter '%s'.

source: Invalid data type for 1-dimensional parameter '%s'.
de: Ungültiger Datentyp für den 1-dimensionalen Parameter '%s'.

source: Varying data types for 1-dimensional parameter '%s' not allowed.
de: Unterschiedliche Datentypen für den 1-dimensionalen Parameter '%s' sind nicht zulässig.

source: Invalid data type for 2-dimensional parameter '%s'.
de: Ungültiger Datentyp für den 2-dimensionalen Parameter '%s'.

source: Varying data types or array dimensions for 2-dimensional parameter '%s' not allowed.
de: Unterschiedliche Datentypen oder Arraydimensionen für den 2-dimensionalen Parameter '%s' sind nicht zulässig.

source: Types of parameter '%s' do not match: data type '%s' != field type '%s'
de: Typen des Parameters '%s' stimmen nicht überein: Datentyp '%s' != Feldtyp '%s'

source: Data model of dynamic form not initialized.
de: Datenmodell des dynamischen Formulars nicht initialisiert.

source: The dynamic form specification is invalid:
de: Die dynamische Formularspezifikation ist ungültig:

source: Cancel
de: Abbrechen

source: Revert
de: Zurücksetzen

source: Dynamic Form Dialog
de: Dynamischer Formulardialog

source: The number entered is not a valid decimal number.
de: Die eingegebene Zahl ist keine gültige Dezimalzahl.

source: The number entered is not a valid hexadecimal number.
de: Die eingegebene Zahl ist keine gültige hexadezimale Zahl.

source: Validation conflict
de: Validierungskonflikt

source: Programming...
de: Programmierung läuft...

source: &Cancel
de: &Abbrechen

source: Do you really want to cancel the operation?
de: Möchten Sie den Vorgang wirklich abbrechen?

source: Please confirm
de: Bitte bestätigen

source: Enter pass phrase
de: Passwort eingeben

source: EHX File Encryption
de: EHX-Dateiverschlüsselung

source: Opening file '%s' failed.
de: Das Öffnen der Datei '%s' ist fehlgeschlagen.

source: Programming Configuration
de: Programmierkonfiguration

source: Target:
de: Ziel:

source: Configure...
de: Konfigurieren...

source: Save as ehx...
de: Speichern als ehx...

source: Tools...
de: Werkzeuge...

source: Error detected for firmware image file '%s':
de: Fehler für Firmware-Image-Datei '%s' erkannt:

source: The file will be removed from the list of selected firmware image files.
de: Die Datei wird aus der Liste der ausgewählten Firmware-Image-Dateien entfernt.

source: Error
de: Fehler

source: Browse...
de: Durchsuchen ...

source: Remove
de: Entfernen

source: Remove all
de: Alle entfernen

source: Choose a Firmware Image File
de: Firmware-Image-Datei auswählen

source: Firmware Image Files
de: Firmware-Image-Dateien

source: Keys must be formatted as hex numbers.
de: Schlüssel müssen als Hex-Zahlen formatiert werden.

source: Hex numbers are specified with a leading '$' or '0x'.
de: Hex-Zahlen werden mit einem führenden '$' oder '0x' angegeben.

source: Key not a valid 16-bit integer.
de: Schlüssel keine gültige 16-Bit-Ganzzahl.

source: Target configuration
de: Zielkonfiguration

source: (simply click OK for no encryption)
de: (Klicken Sie einfach auf OK, um ohne Verschlüsselung fortzufahren)

source: Choose an EHX File
de: Wählen Sie eine EHX-Datei

source: EHX Files
de: EHX-Dateien

source: Saving EHX file '%s' failed.
de: Das Speichern als EHX-Datei '%s' ist fehlgeschlagen.

source: Attach to running processor
de: An laufenden Prozessor anschließen

source: Activating feature '%s' failed.
de: Die Aktivierung der Funktion '%s' ist fehlgeschlagen.

source: Scan Ports
de: Ports suchen

source: English
de: Englisch

source: The language '%s' is not supported by the system.
de: Die Sprache '%s' wird vom System nicht unterstützt.

source: Couldn't find/load the 'c2prog' and/or 'cldr' catalog for locale '%s'.
de: Der Katalog 'c2prog' und/oder 'cldr' für Gebietsschema '%s' konnte nicht gefunden/geladen werden.

source: unknown
de: unbekannt

source: An unexpected API error occurred:
de: Ein unerwarteter API-Fehler ist aufgetreten:

source: Would you like to check if a newer version of this application is available?
de: Möchten Sie überprüfen, ob eine neuere Version dieser Anwendung verfügbar ist?

source: A newer version of this application is available
de: Eine neuere Version dieser Anwendung ist verfügbar

source: Would you like to download it?
de: Möchten Sie sie herunterladen?

source: &Yes
de: &Ja

source: &No
de: &Nein
